# EXL_SetCellStrFormula

## Description
Write cell value as a string formula.

```pascal
FUNCTION EXL_SetCellStrFormula(
				sheetIndex    : INTEGER;
				cellRow       : INTEGER;
				cellColumn    : INTEGER;
				formulaString : STRING;
				formulaValue  : STRING): BOOLEAN;
```

```python
def vs.EXL_SetCellStrFormula(sheetIndex, cellRow, cellColumn, formulaString, formulaValue):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|sheetIndex|INTEGER|   |
|cellRow|INTEGER|   |
|cellColumn|INTEGER|   |
|formulaString|STRING|   |
|formulaValue|STRING|   |

## Version
Availability: from Vectorworks 2021

## Category
* Excel